import utils

def main():
    input_data = input("Введите сообщение: ")
    msg = utils.important_message(input_data)
    return msg
    
    
# E:\Ilya\Working\Bobkov\2024.11.30>python -i 1.py
# >>> msg = main()
# Введите сообщение: Какое-то сообщение
# >>> print(msg)
# #--------------------------------------------------------------------------------------------------------------------#
# #                                                                                                                                                                                   #
# #                                                Какое-то сообщение                                                                                            #
# #                                                                                                                                                                                    #
# #--------------------------------------------------------------------------------------------------------------------#
# 
# >>> msg = main()
# Введите сообщение: Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы
# >>> print(msg)
# #----------------------------------------------------------------------------------------------------------------------------------------------------#
# #                                                                                                                                                                                                                                      #
# #         Обратите внимание на очень важное сообщение от команды разработчиков этой великолепной программы           #
# #                                                                                                                                                                                                                                     #
# #----------------------------------------------------------------------------------------------------------------------------------------------------#
